Revit 2027 API
RevitLinkType.IsFromRevitServer Method
 Checks whether the Revit link is located on Revit Server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFromRevitServer()
Public Function IsFromRevitServer As Boolean
public:
bool IsFromRevitServer()
member IsFromRevitServer : unit -> bool
Return Value
Boolean
 Returns true if the Revit link is located on Revit Server.
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace